g(x) = x^4 - 4*x^2 + 3
c, d = -2, 2

# Проверка на унимодальность для функции f
if is_unimodal_first_derivative(f, a, b)
    @printf("Функция f унимодальна на интервале [%f, %f] по первой производной\n", a, b)
else
    @printf("Функция f не унимодальна на интервале [%f, %f] по первой производной\n", a, b)
end

if is_unimodal_second_derivative(f, a, b)
    @printf("Функция f унимодальна на интервале [%f, %f] по второй производной\n", a, b)
else
    @printf("Функция f не унимодальна на интервале [%f, %f] по второй производной\n", a, b)
end

# Проверка на унимодальность для функции g
if is_unimodal_first_derivative(g, c, d)
    @printf("Функция g унимодальна на интервале [%f, %f] по первой производной\n", c, d)
else
    @printf("Функция g не унимодальна на интервале [%f, %f] по первой производной\n", c, d)
end

if is_unimodal_second_derivative(g, c, d)
    @printf("Функция g унимодальна на интервале [%f, %f] по второй производной\n", c, d)
else
    @printf("Функция g не унимодальна на интервале [%f, %f] по второй производной\n", c, d)
end